sysbench/output/cacheline128/oltp-update-non-index.out
sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 1 tps: 183.12 qps: 183.12 (r/w/o: 0.00/183.12/0.00) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 1 tps: 181.62 qps: 181.62 (r/w/o: 0.00/181.62/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 1 tps: 186.60 qps: 186.60 (r/w/o: 0.00/186.60/0.00) lat (ms,95%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 183.00 qps: 183.00 (r/w/o: 0.00/183.00/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 1 tps: 191.40 qps: 191.40 (r/w/o: 0.00/191.40/0.00) lat (ms,95%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 179.00 qps: 179.00 (r/w/o: 0.00/179.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 1 tps: 180.60 qps: 180.60 (r/w/o: 0.00/180.60/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 182.40 qps: 182.40 (r/w/o: 0.00/182.40/0.00) lat (ms,95%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 1 tps: 184.40 qps: 184.40 (r/w/o: 0.00/184.40/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 187.80 qps: 187.80 (r/w/o: 0.00/187.80/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 1 tps: 181.40 qps: 181.40 (r/w/o: 0.00/181.40/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           11034
        other:                           0
        total:                           11034
    transactions:                        11034  (183.89 per sec.)
    queries:                             11034  (183.89 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      183.8903
    time elapsed:                        60.0032s
    total number of events:              11034

Latency (ms):
         min:                                    2.75
         avg:                                    5.44
         max:                                   43.75
         95th percentile:                        8.28
         sum:                                59984.56

Threads fairness:
    events (avg/stddev):           11034.0000/0.00
    execution time (avg/stddev):   59.9846/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 2
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 2 tps: 354.63 qps: 354.63 (r/w/o: 0.00/354.63/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 2 tps: 328.62 qps: 328.62 (r/w/o: 0.00/328.62/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 2 tps: 354.41 qps: 354.41 (r/w/o: 0.00/354.41/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 2 tps: 361.00 qps: 361.00 (r/w/o: 0.00/361.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 2 tps: 354.00 qps: 354.00 (r/w/o: 0.00/354.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 2 tps: 358.20 qps: 358.20 (r/w/o: 0.00/358.20/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 2 tps: 333.39 qps: 333.39 (r/w/o: 0.00/333.39/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 2 tps: 355.00 qps: 355.00 (r/w/o: 0.00/355.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 2 tps: 350.80 qps: 350.80 (r/w/o: 0.00/350.80/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 2 tps: 362.01 qps: 362.01 (r/w/o: 0.00/362.01/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 2 tps: 342.60 qps: 342.60 (r/w/o: 0.00/342.60/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 2 tps: 340.40 qps: 340.40 (r/w/o: 0.00/340.40/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           20978
        other:                           0
        total:                           20978
    transactions:                        20978  (349.61 per sec.)
    queries:                             20978  (349.61 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      349.6116
    time elapsed:                        60.0037s
    total number of events:              20978

Latency (ms):
         min:                                    2.87
         avg:                                    5.72
         max:                                  215.68
         95th percentile:                        9.22
         sum:                               119974.52

Threads fairness:
    events (avg/stddev):           10489.0000/1.00
    execution time (avg/stddev):   59.9873/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 4 tps: 558.96 qps: 558.96 (r/w/o: 0.00/558.96/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 4 tps: 601.04 qps: 601.04 (r/w/o: 0.00/601.04/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 4 tps: 633.79 qps: 633.79 (r/w/o: 0.00/633.79/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 642.00 qps: 642.00 (r/w/o: 0.00/642.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 4 tps: 613.40 qps: 613.40 (r/w/o: 0.00/613.40/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 602.60 qps: 602.80 (r/w/o: 0.00/602.80/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 4 tps: 598.00 qps: 597.80 (r/w/o: 0.00/597.80/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 594.59 qps: 594.59 (r/w/o: 0.00/594.59/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 4 tps: 598.19 qps: 598.19 (r/w/o: 0.00/598.19/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 520.81 qps: 520.81 (r/w/o: 0.00/520.81/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 4 tps: 559.80 qps: 559.80 (r/w/o: 0.00/559.80/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 618.80 qps: 618.80 (r/w/o: 0.00/618.80/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           35715
        other:                           0
        total:                           35715
    transactions:                        35715  (595.21 per sec.)
    queries:                             35715  (595.21 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      595.2129
    time elapsed:                        60.0037s
    total number of events:              35715

Latency (ms):
         min:                                    2.90
         avg:                                    6.72
         max:                                  765.04
         95th percentile:                       10.65
         sum:                               239959.84

Threads fairness:
    events (avg/stddev):           8928.7500/9.28
    execution time (avg/stddev):   59.9900/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 8 tps: 1150.23 qps: 1150.23 (r/w/o: 0.00/1150.23/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 8 tps: 1069.99 qps: 1069.99 (r/w/o: 0.00/1069.99/0.00) lat (ms,95%): 11.65 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 8 tps: 1154.21 qps: 1154.21 (r/w/o: 0.00/1154.21/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1126.81 qps: 1126.81 (r/w/o: 0.00/1126.81/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 8 tps: 1171.00 qps: 1171.00 (r/w/o: 0.00/1171.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 1113.59 qps: 1113.59 (r/w/o: 0.00/1113.59/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 8 tps: 1077.56 qps: 1077.56 (r/w/o: 0.00/1077.56/0.00) lat (ms,95%): 12.08 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1009.60 qps: 1009.60 (r/w/o: 0.00/1009.60/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 8 tps: 1141.66 qps: 1141.66 (r/w/o: 0.00/1141.66/0.00) lat (ms,95%): 11.04 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1107.36 qps: 1107.36 (r/w/o: 0.00/1107.36/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 8 tps: 1098.64 qps: 1098.64 (r/w/o: 0.00/1098.64/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 1083.40 qps: 1083.40 (r/w/o: 0.00/1083.40/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           66531
        other:                           0
        total:                           66531
    transactions:                        66531  (1108.75 per sec.)
    queries:                             66531  (1108.75 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1108.7543
    time elapsed:                        60.0052s
    total number of events:              66531

Latency (ms):
         min:                                    3.05
         avg:                                    7.21
         max:                                   50.42
         95th percentile:                       11.45
         sum:                               479932.77

Threads fairness:
    events (avg/stddev):           8316.3750/24.72
    execution time (avg/stddev):   59.9916/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 16
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 16 tps: 1922.53 qps: 1922.53 (r/w/o: 0.00/1922.53/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 16 tps: 2041.39 qps: 2041.39 (r/w/o: 0.00/2041.39/0.00) lat (ms,95%): 11.45 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 16 tps: 1937.01 qps: 1937.01 (r/w/o: 0.00/1937.01/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 1933.60 qps: 1933.60 (r/w/o: 0.00/1933.60/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 16 tps: 2044.23 qps: 2044.23 (r/w/o: 0.00/2044.23/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 1988.16 qps: 1988.16 (r/w/o: 0.00/1988.16/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 16 tps: 1972.98 qps: 1972.98 (r/w/o: 0.00/1972.98/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 1837.36 qps: 1837.36 (r/w/o: 0.00/1837.36/0.00) lat (ms,95%): 15.83 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 16 tps: 1974.88 qps: 1974.88 (r/w/o: 0.00/1974.88/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 1983.79 qps: 1983.79 (r/w/o: 0.00/1983.79/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 16 tps: 1998.98 qps: 1998.98 (r/w/o: 0.00/1998.98/0.00) lat (ms,95%): 12.30 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 2013.03 qps: 2013.03 (r/w/o: 0.00/2013.03/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           118261
        other:                           0
        total:                           118261
    transactions:                        118261 (1970.79 per sec.)
    queries:                             118261 (1970.79 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      1970.7893
    time elapsed:                        60.0069s
    total number of events:              118261

Latency (ms):
         min:                                    3.11
         avg:                                    8.12
         max:                                   63.09
         95th percentile:                       12.52
         sum:                               959910.71

Threads fairness:
    events (avg/stddev):           7391.3125/13.04
    execution time (avg/stddev):   59.9944/0.00

sysbench 1.1.0-bd4b418 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 32
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 32 tps: 3305.51 qps: 3305.51 (r/w/o: 0.00/3305.51/0.00) lat (ms,95%): 16.41 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 32 tps: 3523.12 qps: 3523.12 (r/w/o: 0.00/3523.12/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 32 tps: 3638.03 qps: 3638.03 (r/w/o: 0.00/3638.03/0.00) lat (ms,95%): 12.75 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 32 tps: 3578.35 qps: 3578.35 (r/w/o: 0.00/3578.35/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 32 tps: 3514.25 qps: 3514.25 (r/w/o: 0.00/3514.25/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 32 tps: 3588.89 qps: 3588.89 (r/w/o: 0.00/3588.89/0.00) lat (ms,95%): 12.98 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 32 tps: 3493.63 qps: 3493.63 (r/w/o: 0.00/3493.63/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 3487.44 qps: 3487.44 (r/w/o: 0.00/3487.44/0.00) lat (ms,95%): 14.21 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 32 tps: 3602.33 qps: 3602.33 (r/w/o: 0.00/3602.33/0.00) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 32 tps: 3538.90 qps: 3538.90 (r/w/o: 0.00/3538.90/0.00) lat (ms,95%): 13.70 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 32 tps: 3521.21 qps: 3521.21 (r/w/o: 0.00/3521.21/0.00) lat (ms,95%): 13.46 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 3591.71 qps: 3591.71 (r/w/o: 0.00/3591.71/0.00) lat (ms,95%): 13.22 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           211963
        other:                           0
        total:                           211963
    transactions:                        211963 (3532.07 per sec.)
    queries:                             211963 (3532.07 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      3532.0670
    time elapsed:                        60.0110s
    total number of events:              211963

Latency (ms):
         min:                                    3.02
         avg:                                    9.06
         max:                                   54.28
         95th percentile:                       13.95
         sum:                              1919906.02

Threads fairness:
    events (avg/stddev):           6623.8438/20.79
    execution time (avg/stddev):   59.9971/0.00